murray-lang/nexusdr/src/app/stm32h745i/CM7/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/

// extern "C" {
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32h745i_discovery_qspi.h"
#include "lvgl/lvgl.h"
#include "lvgl_port_lcd.h"
#include "lvgl_port_touchpad.h"
#include "lvgl/demos/lv_demos.h"
// }
#include <stdio.h>
#include <stm32h745i_discovery_mmc.h>
#include <string.h>

#include "emmc_storage.h"
#include "fatfs_storage.h"
// #include "nlohmann/json.hpp"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#ifndef HSEM_ID_0
#define HSEM_ID_0 (0U) /* HW semaphore 0*/
#endif
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

//DMA2D_HandleTypeDef hdma2d;
//
//I2C_HandleTypeDef hi2c4;
//
//LTDC_HandleTypeDef hltdc;
//
//QSPI_HandleTypeDef hqspi;
//
//TIM_HandleTypeDef htim8;
//
//UART_HandleTypeDef huart3;
//
//MDMA_HandleTypeDef hmdma_mdma_channel40_sw_0;
//SDRAM_HandleTypeDef hsdram1;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
//static void MX_GPIO_Init(void);
//static void MX_FMC_Init(void);
//static void MX_LTDC_Init(void);
//static void MX_QUADSPI_Init(void);
//static void MX_MDMA_Init(void);
//static void MX_I2C4_Init(void);
//static void MX_DMA2D_Init(void);
//static void MX_TIM8_Init(void);
//static void MX_USART3_UART_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

// Redirect printf to ITM
// int _write(int file, char *ptr, int len) {
//   for(int i = 0; i < len; i++) {
//     ITM_SendChar((*ptr++));
//   }
//   return len;
// }

/* USER CODE END 0 */

int fatfsRc = 0;
uint32_t format_attempt = 0;
uint32_t emmc_error_code = 0;
uint32_t emmc_timeout_count = 0;
uint32_t diskio_writes = 0;
uint32_t diskio_reads = 0;
uint32_t diskio_write_errs = 0;
uint32_t diskio_read_errs = 0;
uint32_t diskio_last_ioctl = 0;
uint32_t diskio_read_sector = 0;
uint32_t diskio_read_not_initialized = 0;
uint32_t diskio_read_emmc_err = 0;
uint32_t diskio_last_read_res = 0;
uint32_t diskio_first_err_sector = 0;
uint32_t diskio_err_busy_count = 0;
uint32_t ioctl_sector_count_res = 0;
uint32_t ioctl_sector_size_res = 0;
uint32_t card_block_count = 0;
uint32_t card_block_size = 0;
uint32_t card_blocknbr_raw = 0;
uint32_t card_blocksize_raw = 0;
uint32_t write_err_busy = 0;
uint32_t write_first_err_sector = 0;
uint32_t write_last_sector = 0;
uint32_t write_emmc_status = 0;
uint32_t write_err_buff_addr = 0;
uint32_t write_last_buff_addr = 0;
uint32_t mmc_state_before_write = 0;
uint32_t mmc_state_at_busy = 0;
uint32_t hal_error_code = 0;
/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */
/* USER CODE BEGIN Boot_Mode_Sequence_0 */
	int32_t timeout;
/* USER CODE END Boot_Mode_Sequence_0 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

/* USER CODE BEGIN Boot_Mode_Sequence_1 */
	/* Wait until CPU2 boots and enters in stop mode or timeout*/
	// timeout = 0xFFFF;
	// while ((__HAL_RCC_GET_FLAG(RCC_FLAG_D2CKRDY) != RESET) && (timeout-- > 0))
	// 	;
	// if (timeout < 0)
	// {
	// 	Error_Handler();
	// }
/* USER CODE END Boot_Mode_Sequence_1 */
  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();
/* USER CODE BEGIN Boot_Mode_Sequence_2 */
	/* When system initialization is finished, Cortex-M7 will release Cortex-M4 by means of
	 HSEM notification */
	/*HW semaphore Clock enable*/
	__HAL_RCC_HSEM_CLK_ENABLE();
	/*Take HSEM */
	HAL_HSEM_FastTake(HSEM_ID_0);
	/*Release HSEM in order to notify the CPU2(CM4)*/
	HAL_HSEM_Release(HSEM_ID_0, 0);
	/* wait until CPU2 wakes up from stop mode */
	timeout = 0xFFFF;
	while ((__HAL_RCC_GET_FLAG(RCC_FLAG_D2CKRDY) == RESET) && (timeout-- > 0))
		;
	if (timeout < 0)
	{
		Error_Handler();
	}
/* USER CODE END Boot_Mode_Sequence_2 */

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
//  MX_GPIO_Init();
//  MX_FMC_Init();
//  MX_LTDC_Init();
//  MX_QUADSPI_Init();
//  MX_MDMA_Init();
//  MX_I2C4_Init();
//  MX_DMA2D_Init();
//  MX_TIM8_Init();
//  MX_USART3_UART_Init();
  /* USER CODE BEGIN 2 */
	//CRITICAL: Init QSPI Memory FIRST - application code is in QSPI flash
	BSP_QSPI_Init_t qspi_init;
	qspi_init.InterfaceMode = MT25TL01G_QPI_MODE;
	qspi_init.TransferRate = MT25TL01G_DTR_TRANSFER;
	qspi_init.DualFlashMode = MT25TL01G_DUALFLASH_ENABLE;
	BSP_QSPI_Init(0, &qspi_init);
	BSP_QSPI_EnableMemoryMappedMode(0);

  BSP_LED_Init(LED1);
  BSP_LED_Init(LED2);

  if (EMMC_Init() == EMMC_OK) {
    FS_StatusTypeDef rc;

